package pet.project.shugarKing.malfunctions.type;

public enum AllMalfunction {

    ВЫТЕКАНИЕ_ЖИДКОСТИ_ИЗ_ПОД_ДНИЩА_АВТОМОБИЛЯ,

    НЕИЗВЕСТНЫЕ_РУДИМЕНТЫ_ПОД_ДНИЩЕМ_АВТОМОБИЛЯ,

    НЕ_ЗАКРЫТА_ДВЕРЬ_ШТУРМАНА,

    НЕ_ЗАКРЫТА_ДВЕРЬ_ВОДИТЕЛЯ,

    НЕ_ЗАКРЫТА_ЛЕВАЯ_ЗАДНЯЯ_ДВЕРЬ,

    НЕ_ЗАКРЫТА_ПРАВАЯ_ЗАДНЯЯ_ДВЕРЬ,

    НЕИСПРАВНОСТЬ_ЛЕВЫХ_ЗАДНИХ_ОСВЕТИТЕЛЬНЫХ_ПРИБОРОВ,

    НЕИСПРАВНОСТЬ_ПРАВЫХ_ЗАДНИХ_ОСВЕТИТЕЛЬНЫХ_ПРИБОРОВ,

    НЕИСПРАВНОСТЬ_ЛЕВЫХ_ПЕРЕДНИХ_ОСВЕТИТЕЛЬНЫХ_ПРИБОРОВ,

    НЕИСПРАВНОСТЬ_ПРАВЫХ_ПЕРЕДНИХ_ОСВЕТИТЕЛЬНЫХ_ПРИБОРОВ,

    СПУСКАЕТ_ЛЕВОЕ_ПЕРЕДНЕЕ_КОЛЕСО,

    СПУСКАЕТ_ПРАВОЕ_ПЕРЕДНЕЕ_КОЛЕСО,

    СПУСКАЕТ_ЛЕВОЕ_ЗАДНЕЕ_КОЛЕСО,

    СПУСКАЕТ_ПРАВОЕ_ЗАДНЕЕ_КОЛЕСО
}
